## Plan Result (prod-backendappgateway)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-aks00-prod-agw"
      + resource_group_name = "cft-prod-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "draft-store-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "cmc-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rpe-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rpe-service-auth-provider"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "camunda-bpm"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "camunda-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "camunda-optimize"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-business-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-orchestrator-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-submit-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-back-office"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "pcq-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "lau-case-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "lau-idam-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-notifications-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-documents-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-timed-event-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-home-office-integration-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-payments-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-access-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-fps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-dgs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-cms"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-hm"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-cfs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-ns"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-ps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-dgcs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-anno"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-npa"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-stitching"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-ccd-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-icp"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-hrs-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-hrs-ingestor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "dg-docassembly"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "dm-store"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-tribunals-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-evidence-share"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-bulk-scan"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-ccd-callback-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-tya-notif"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "fpl-case-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "payment-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "fees-register-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccpay-refunds-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ethos-repl-docmosis-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ethos-ecm-consumer"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-data-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-definition-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-user-profile-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-case-print-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-case-activity-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-admin-web"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-message-publisher"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-case-document-am-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "aac-manage-case-assignment"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "cpo-case-payment-orders-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bar-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-professional-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-user-profile-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-profile-sync"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-judicial-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-location-ref-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-caseworker-ref-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-commondata-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "am-role-assignment-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "am-org-role-mapping-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bulk-scan-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bulk-scan-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bulk-scan-payment-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "reform-scan-blob-router"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.2

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

                        = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + public_ip_address_id          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-prod-pip-1"
          + subnet_id                     = (known after apply)
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.90.96.11"
          + private_ip_address_allocation = "Static"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-appgw"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "plum-recipe-backend-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "plum-recipe-backend"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "et-cos-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "et-cos"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "et-msg-handler-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "et-msg-handler"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "et-sya-api-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "et-sya-api"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "ts-translation-service-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "ts-translation-service"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "ia-bail-case-api-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "ia-bail-case-api"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "am-judicial-booking-service-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "am-judicial-booking-service"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-aks-prod-agw",
            ]
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "plum-recipe-backend-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "plum-recipe-backend"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "et-cos-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "et-cos"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "et-msg-handler-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "et-msg-handler"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "et-sya-api-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "et-sya-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "ts-translation-service-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "ts-translation-service"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "ia-bail-case-api-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "ia-bail-case-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "am-judicial-booking-service-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "am-judicial-booking-service"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "am-judicial-booking-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "am-judicial-booking-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "am-judicial-booking-service"
          + id                         = (known after apply)
          + name                       = "am-judicial-booking-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-cos"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-cos"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-cos"
          + id                         = (known after apply)
          + name                       = "et-cos"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-msg-handler"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-msg-handler"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-msg-handler"
          + id                         = (known after apply)
          + name                       = "et-msg-handler"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-sya-api"
          + id                         = (known after apply)
          + name                       = "et-sya-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ia-bail-case-api"
          + id                         = (known after apply)
          + 1mname                       = "ia-bail-case-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum-recipe-backend"
          + id                         = (known after apply)
          + name                       = "plum-recipe-backend"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = "https://acmedcdcftappsprod.vault.azure.net/secrets/wildcard-platform-hmcts-net"
          + name                = "wildcard-platform-hmcts-net"
          + public_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1304,"Program":"tfcmt","SHA1":"","Target":"prod-backendappgateway","Vars":{}} -->